CREATE DATABASE IF NOT EXISTS life_space_01;

use life_space_01;

-- Drop Tables
DROP TABLE IF EXISTS space;
DROP TABLE IF EXISTS branch;

-- Create Tablesevemt
CREATE TABLE branch (
	branch_id VARCHAR(5) PRIMARY KEY,
	branch_name VARCHAR(50) NOT NULL,
	branch_addr VARCHAR(255) NOT NULL,
	space_qty INT NOT NULL,
	latitude DOUBLE NOT NULL,
	longitude DOUBLE NOT NULL,
	branchstatus INT Not Null,
	created_time TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
);

CREATE TABLE space (
    space_id VARCHAR(5) PRIMARY KEY,
    branch_id VARCHAR(5) NOT NULL,
    space_name VARCHAR(50) NOT NULL,
    space_people INT NOT NULL,
    space_size DOUBLE NOT NULL,
    space_hourly_fee INT,
    space_daily_fee INT,
    space_desc VARCHAR(1000),
    space_rating DOUBLE DEFAULT 0.0,
    space_alert VARCHAR(1000),
    space_used_24hr DOUBLE DEFAULT 0.0,
    space_used_7d DOUBLE DEFAULT 0.0,
    space_status INT NOT NULL,
    space_address VARCHAR(255) NOT NULL,
    latitude DOUBLE NOT NULL,
    longitude DOUBLE NOT NULL,
    created_time TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
    CONSTRAINT fk_space_branch_branch_id FOREIGN KEY (branch_id) REFERENCES branch (branch_id)
);

-- Insert Data

INSERT INTO branch (branch_id, branch_name, branch_addr, space_qty, latitude, longitude, branchStatus) VALUES 
('B001', '松江南京', '台北市松江南京區北平西路3號1樓', 1,25.033964, 121.564468, 1),
('B002', '東門', '台北市東門區北平西路3號1樓', 2,25.034496,121.521984, 1),
('B003', '南京復興', '台北市南京復興區北平西路3號1樓', 3,25.087562,121.525450, 1),
('B004', '台北車站', '台北市中正區北平西路3號1樓', 4,25.047760, 121.517050, 1),
('B005', '西門町', '台北市西門區北平西路3號1樓', 5,25.137792,121.506510, 0);

INSERT INTO space (space_id, branch_id, space_name, space_people, space_size, space_hourly_fee, space_daily_fee, space_desc, space_alert, space_status, space_address, latitude, longitude) VALUES 
('S001','B001','Cozy 601',4,20.0,200,1200,'這個空間環境優美，設備齊全且現代化，非常適合家庭聚會與創意工作，讓人感受到溫馨舒適的氛圍。',null,1,'台北市中正區北平西路12號6樓',25.048,121.517),
('S002','B001','Cozy 602',15,32.5,400,2000,'溫馨舒適的環境，適合舉辦中型會議與各類培訓活動，更能營造專業氛圍。',null,1,'台北市中正區北平西路12號6樓',25.048,121.517),
('S003','B001','Cozy 603',20,40.0,500,3000,'採光充足並配備先進設備，激發團隊創意與靈感，適合不同規模交流。',null,1,'台北市中正區北平西路12號6樓',25.048,121.517),
('S004','B001','Cozy 604',8,20.0,300,1800,'提供專業辦公環境與安靜氛圍，能有效提升工作效率，助您專心投入。',null,1,'台北市中正區北平西路12號6樓',25.048,121.517),
('S005','B001','Cozy 605',50,100.0,1000,6000,'寬敞開闊的場地，能靈活布置各式佈景，特別適合舉辦成果發表或大型演出。',null,1,'台北市中正區北平西路12號6樓',25.048,121.517),

('S006','B002','Energy 801',4,20.0,250,1400,'該空間設計雅致，設備完善，能滿足商務洽談及會議需求，環境舒適且極具現代感。',null,1,'台北市中山區中山北路三段57號8樓',25.064,121.522),
('S007','B002','Energy 802',2,18.5,150,900,'寧靜舒適的空間設計，適合小規模會議及私密討論，環境溫馨且設備完善。',null,1,'台北市中山區中山北路三段57號8樓',25.064,121.522),
('S008','B002','Energy 803',4,25.0,200,1200,'明亮現代的工作室環境，適宜創意思考及小組討論，提供舒適又實用的設施。',null,1,'台北市中山區中山北路三段57號8樓',25.064,121.522),
('S009','B002','Energy 901',6,30.0,250,1500,'多功能展示間提供靈活空間佈局，適合產品發布與品牌推廣，環境優雅具現代感。',null,1,'台北市中山區中山北路三段57號9樓',25.064,121.522),
('S010','B002','Energy 902',3,22.0,180,1100,'精緻接待室設計精心打造，環境幽雅適合舉辦商務洽談及私人會議，服務細緻周到。',null,1,'台北市中山區中山北路三段57號9樓',25.064,121.522),
('S011','B002','Energy 903',8,28.0,300,1300,'溫馨家庭會客室設計充滿親和力，適合小家庭聚會與輕鬆交談，空間布置充滿生活情趣。',null,1,'台北市中山區中山北路三段57號9樓',25.064,121.522),

('S012','B003','Chill 401',10,30.0,300,1500,'此空間裝潢典雅，環境舒適，配置完善且光線充足，非常適合舉辦各種小型會議與休閒聚會。',null,1,'台北市內湖區內湖路一段445號4樓',25.083,121.575),
('S013','B003','Chill 402',8,25.0,250,1400,'空間設計精緻，提供高品質設備與舒適環境，適合小規模會議及創意思考的場所。',null,1,'台北市內湖區內湖路一段445號4樓',25.083,121.575),
('S014','B003','Chill 403',15,35.0,350,1600,'室內空間裝潢現代化，採光良好且通風順暢，能滿足團隊討論和創意發想的需要。',null,1,'台北市內湖區內湖路一段445號4樓',25.083,121.575),
('S015','B003','Chill 404',50,50.0,500,3000,'展演廳空間寬敞，聲光設備先進，適合各類表演和展示活動，營造出極佳的藝術氛圍。',null,1,'台北市內湖區內湖路一段445號4樓',25.083,121.575),
('S016','B003','Chill 1001',100,80.0,2000,15000,'空間內部裝潢豪華，空間布局合理，提供頂級服務與完善設施，適合舉辦大型慶典及商務活動。',null,1,'台北市內湖區內湖路一段445號10樓',25.083,121.575),

('S017','B004','Focus 1501',1,10.0,100,600,'這個空間小巧精緻，適合個人或雙人小會議，環境安靜舒適，設施完善可靠。',null,1,'台北市文山區木柵路二段88號15樓',24.988,121.569),
('S018','B004','Focus 1502',1,12.0,120,700,'單人工作室提供靜謐環境，適合個人專注工作，空間布局合理，讓人心情舒暢安心。',null,1,'台北市文山區木柵路二段88號15樓',24.988,121.569),
('S019','B004','Focus 1503',2,15.0,150,800,'微型洽談室設計精緻，適合一對一或小型會面，營造私密氛圍，讓交流更加順暢自在。',null,1,'台北市文山區木柵路二段88號15樓',24.988,121.569),
('S020','B004','Focus 1504',2,18.0,130,750,'靜謐小書房提供溫馨閱讀環境，適合靜心研讀與思考，空間小巧卻充滿文藝氣息。',null,1,'台北市文山區木柵路二段88號15樓',24.988,121.569),
('S021','B004','Focus 1505',3,20.0,150,900,'此空間設計優雅，設備先進，適合舉辦小型會議與私人聚會，環境安靜宜人。',null,1,'台北市文山區木柵路二段88號15樓',24.988,121.569),
('S022','B004','Focus 1506',6,25.0,180,1000,'空間明亮寬敞，佈局合理，專為中小規模聚會及商務洽談設計，創造舒適交流環境。',null,1,'台北市文山區木柵路二段88號15樓',24.988,121.569),
('S023','B004','Focus 1507',10,30.0,200,1200,'設施完善且現代化，空間氣氛溫馨，特別適合家庭聚會或小型工作坊，令人印象深刻。',null,1,'台北市文山區木柵路二段88號15樓',24.988,121.569),

('S024','B005','Life 801',20,50.0,400,2500,'此會議室設計現代化，空間寬敞明亮，適合舉辦中大型會議與各類活動，並提供先進設備，讓參與者倍感舒適。',null,1,'台北市中正區漢口街一段36號8樓',25.045,121.514),
('S025','B005','Life 802',4,10.0,200,1200,'該空間寬敞設計現代，提供全面服務，環境安全舒適。',null,1,'台北市中正區漢口街一段36號8樓',25.045,121.514);
